In [1]:
import pandas as pd

In [2]:
CCTV_Seoul = pd.read_csv('data/seoul_in_cctv.csv', encoding='utf-8')
CCTV_Seoul.head()

   기관명    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  3238       1292    430    584    932
1  강동구  1010        379     99    155    377
2  강북구   831        369    120    138    204
3  강서구   911        388    258    184     81
4  관악구  2109        846    260    390    613

In [3]:
CCTV_Seoul.columns

Index(['기관명', '소계', '2013년도 이전', '2014년', '2015년', '2016년'], dtype='object')

In [4]:
CCTV_Seoul.columns[0]

'기관명'

In [5]:
CCTV_Seoul.rename(columns={CCTV_Seoul.columns[0]: '구별'}, inplace=True)
CCTV_Seoul.head()

    구별    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  3238       1292    430    584    932
1  강동구  1010        379     99    155    377
2  강북구   831        369    120    138    204
3  강서구   911        388    258    184     81
4  관악구  2109        846    260    390    613

In [6]:
pop_seoul=pd.read_excel('data/population_in_seoul.xls', encoding='utf-8')
pop_seoul.head()

,기간,자치구,세대,인구,인구.1,인구.2,인구.3,인구.4,인구.5,인구.6,인구.7,인구.8,세대당인구,65세이상고령자
0,기간,자치구,세대,합계,합계,합계,한국인,한국인,한국인,등록외국인,등록외국인,등록외국인,세대당인구,65세이상고령자
1,기간,자치구,세대,계,남자,여자,계,남자,여자,계,남자,여자,세대당인구,65세이상고령자
2,2017.1/4,합계,4202888,10197604,5000005,5197599,9926968,4871560,5055408,270636,128445,142191,2.36,1321458
3,2017.1/4,종로구,72654,162820,79675,83145,153589,75611,77978,9231,4064,5167,2.11,25425
4,2017.1/4,중구,59481,133240,65790,67450,124312,61656,62656,8928,4134,4794,2.09,20764

In [7]:
# 엑셀 내용을 보면 4번째 줄부터 실데이터가 들어있음.
# 필요한 컬럼에 대해서만 데이터를 가져오면 되기 때문에 parse_cols 사용
pop_seoul=pd.read_excel('data/population_in_seoul.xls'
                        , header=2
                        , parse_cols='B,D,G,J,N'
                        , encoding='utf-8')
pop_seoul.head()

   자치구           계        계.1       계.2   65세이상고령자
0   합계  10197604.0  9926968.0  270636.0  1321458.0
1  종로구    162820.0   153589.0    9231.0    25425.0
2   중구    133240.0   124312.0    8928.0    20764.0
3  용산구    244203.0   229456.0   14747.0    36231.0
4  성동구    311244.0   303380.0    7864.0    39997.0

In [8]:
# 컬럼명 변경
pop_seoul.rename(columns={pop_seoul.columns[0]: '구별'
                         , pop_seoul.columns[1]: '인구수'
                         , pop_seoul.columns[2]: '한국인'
                         , pop_seoul.columns[3]: '외국인'
                         , pop_seoul.columns[4]: '고령자'}, inplace=True)
pop_seoul.head()

    구별         인구수        한국인       외국인        고령자
0   합계  10197604.0  9926968.0  270636.0  1321458.0
1  종로구    162820.0   153589.0    9231.0    25425.0
2   중구    133240.0   124312.0    8928.0    20764.0
3  용산구    244203.0   229456.0   14747.0    36231.0
4  성동구    311244.0   303380.0    7864.0    39997.0

In [9]:
###################################
### 1-3 기초 익히기
###################################
import pandas as pd
import numpy as np


s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [10]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [11]:
# 6, 4 의 배열을 만들고 각 컬럼명을 A, B, C, D 로 지정.
# index(row) 는 위에서 지정한 dates 를 사용함
df=pd.DataFrame(np.random.randn(6,4), index=dates, columns=['A','B','C','D'])
df

                   A         B         C         D
2013-01-01 -0.553371  0.070316  0.236039 -0.299385
2013-01-02 -0.008389  0.222572  0.723759  0.775940
2013-01-03  0.338438  2.114345  1.425761  0.355517
2013-01-04 -0.778364 -0.774967  0.301045 -0.250914
2013-01-05 -2.164412  0.606353  0.762934  0.061071
2013-01-06 -1.741547 -0.914965  0.454602 -0.492847

In [12]:
# head 안의 숫자는 보여줄 라인수를 지정. (기본 5행)
df.head(3)

                   A         B         C         D
2013-01-01 -0.553371  0.070316  0.236039 -0.299385
2013-01-02 -0.008389  0.222572  0.723759  0.775940
2013-01-03  0.338438  2.114345  1.425761  0.355517

In [13]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [14]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [15]:
df.values

array([[-0.55337132,  0.0703156 ,  0.23603887, -0.29938467],
       [-0.00838868,  0.22257164,  0.72375907,  0.77593989],
       [ 0.33843794,  2.11434536,  1.42576078,  0.35551719],
       [-0.77836414, -0.77496733,  0.30104462, -0.25091359],
       [-2.16441229,  0.60635303,  0.76293426,  0.06107052],
       [-1.74154718, -0.91496485,  0.45460225, -0.49284653]])

In [16]:
# DateFrame 의 정보를 알 수 있음.
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2013-01-01 to 2013-01-06
Freq: D
Data columns (total 4 columns):
A    6 non-null float64
B    6 non-null float64
C    6 non-null float64
D    6 non-null float64
dtypes: float64(4)
memory usage: 240.0 bytes

In [17]:
# 통계적 개요를 확인
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.817941  0.220609  0.650690  0.024897
std    0.972644  1.098938  0.436190  0.474125
min   -2.164412 -0.914965  0.236039 -0.492847
25%   -1.500751 -0.563647  0.339434 -0.287267
50%   -0.665868  0.146444  0.589181 -0.094922
75%   -0.144634  0.510408  0.753140  0.281906
max    0.338438  2.114345  1.425761  0.775940

In [18]:
# B 를 기준으로 정렬. 내림차순
df.sort_values(by='B', ascending=False)

                   A         B         C         D
2013-01-03  0.338438  2.114345  1.425761  0.355517
2013-01-05 -2.164412  0.606353  0.762934  0.061071
2013-01-02 -0.008389  0.222572  0.723759  0.775940
2013-01-01 -0.553371  0.070316  0.236039 -0.299385
2013-01-04 -0.778364 -0.774967  0.301045 -0.250914
2013-01-06 -1.741547 -0.914965  0.454602 -0.492847

In [19]:
df['A']

2013-01-01   -0.553371
2013-01-02   -0.008389
2013-01-03    0.338438
2013-01-04   -0.778364
2013-01-05   -2.164412
2013-01-06   -1.741547
Freq: D, Name: A, dtype: float64

In [20]:
df[0:3]

                   A         B         C         D
2013-01-01 -0.553371  0.070316  0.236039 -0.299385
2013-01-02 -0.008389  0.222572  0.723759  0.775940
2013-01-03  0.338438  2.114345  1.425761  0.355517

In [21]:
# index 로 범위지정하여 조회
df['20130102':'20130104']

                   A         B         C         D
2013-01-02 -0.008389  0.222572  0.723759  0.775940
2013-01-03  0.338438  2.114345  1.425761  0.355517
2013-01-04 -0.778364 -0.774967  0.301045 -0.250914

In [22]:
# 0번째 index를 row 단위로 보기
df.loc[dates[0]]

A   -0.553371
B    0.070316
C    0.236039
D   -0.299385
Name: 2013-01-01 00:00:00, dtype: float64

In [23]:
df.loc[:,['A','B']]

                   A         B
2013-01-01 -0.553371  0.070316
2013-01-02 -0.008389  0.222572
2013-01-03  0.338438  2.114345
2013-01-04 -0.778364 -0.774967
2013-01-05 -2.164412  0.606353
2013-01-06 -1.741547 -0.914965

In [24]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02 -0.008389  0.222572
2013-01-03  0.338438  2.114345
2013-01-04 -0.778364 -0.774967

In [25]:
df.loc['20130102', ['A','B']]

A   -0.008389
B    0.222572
Name: 2013-01-02 00:00:00, dtype: float64

In [26]:
df.loc[dates[0],'A']

-0.5533713238684714

In [27]:
df.iloc[3]

A   -0.778364
B   -0.774967
C    0.301045
D   -0.250914
Name: 2013-01-04 00:00:00, dtype: float64

In [28]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04 -0.778364 -0.774967
2013-01-05 -2.164412  0.606353

In [29]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02 -0.008389  0.723759
2013-01-03  0.338438  1.425761
2013-01-05 -2.164412  0.762934

In [30]:
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02 -0.008389  0.222572  0.723759  0.775940
2013-01-03  0.338438  2.114345  1.425761  0.355517

In [31]:
df.iloc[:,1:3]

                   B         C
2013-01-01  0.070316  0.236039
2013-01-02  0.222572  0.723759
2013-01-03  2.114345  1.425761
2013-01-04 -0.774967  0.301045
2013-01-05  0.606353  0.762934
2013-01-06 -0.914965  0.454602

In [32]:
df

                   A         B         C         D
2013-01-01 -0.553371  0.070316  0.236039 -0.299385
2013-01-02 -0.008389  0.222572  0.723759  0.775940
2013-01-03  0.338438  2.114345  1.425761  0.355517
2013-01-04 -0.778364 -0.774967  0.301045 -0.250914
2013-01-05 -2.164412  0.606353  0.762934  0.061071
2013-01-06 -1.741547 -0.914965  0.454602 -0.492847

In [33]:
df[df.A >0]

                   A         B         C         D
2013-01-03  0.338438  2.114345  1.425761  0.355517

In [34]:
df[df > 0]

                   A         B         C         D
2013-01-01       NaN  0.070316  0.236039       NaN
2013-01-02       NaN  0.222572  0.723759  0.775940
2013-01-03  0.338438  2.114345  1.425761  0.355517
2013-01-04       NaN       NaN  0.301045       NaN
2013-01-05       NaN  0.606353  0.762934  0.061071
2013-01-06       NaN       NaN  0.454602       NaN

In [35]:
df2 = df.copy()

In [36]:
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']

In [37]:
df2

                   A         B         C         D      E
2013-01-01 -0.553371  0.070316  0.236039 -0.299385    one
2013-01-02 -0.008389  0.222572  0.723759  0.775940    one
2013-01-03  0.338438  2.114345  1.425761  0.355517    two
2013-01-04 -0.778364 -0.774967  0.301045 -0.250914  three
2013-01-05 -2.164412  0.606353  0.762934  0.061071   four
2013-01-06 -1.741547 -0.914965  0.454602 -0.492847  three

In [38]:
df2['E'].isin(['two', 'four'])

2013-01-01    False
2013-01-02    False
2013-01-03     True
2013-01-04    False
2013-01-05     True
2013-01-06    False
Freq: D, Name: E, dtype: bool

In [39]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03  0.338438  2.114345  1.425761  0.355517   two
2013-01-05 -2.164412  0.606353  0.762934  0.061071  four

In [40]:
df

                   A         B         C         D
2013-01-01 -0.553371  0.070316  0.236039 -0.299385
2013-01-02 -0.008389  0.222572  0.723759  0.775940
2013-01-03  0.338438  2.114345  1.425761  0.355517
2013-01-04 -0.778364 -0.774967  0.301045 -0.250914
2013-01-05 -2.164412  0.606353  0.762934  0.061071
2013-01-06 -1.741547 -0.914965  0.454602 -0.492847

In [41]:
vdf.apply(np.cumsum)

                   A         B         C         D
2013-01-01 -0.553371  0.070316  0.236039 -0.299385
2013-01-02 -0.561760  0.292887  0.959798  0.476555
2013-01-03 -0.223322  2.407233  2.385559  0.832072
2013-01-04 -1.001686  1.632265  2.686603  0.581159
2013-01-05 -3.166098  2.238618  3.449538  0.642229
2013-01-06 -4.907646  1.323653  3.904140  0.149383

In [42]:
df.apply(lambda x: x.max() - x.min())

A    2.502850
B    3.029310
C    1.189722
D    1.268786
dtype: float64

In [43]:
CCTV_Seoul.head()

    구별    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  3238       1292    430    584    932
1  강동구  1010        379     99    155    377
2  강북구   831        369    120    138    204
3  강서구   911        388    258    184     81
4  관악구  2109        846    260    390    613

In [44]:
CCTV_Seoul.sort_values(by='소계', ascending=True).head(5)

     구별   소계  2013년도 이전  2014년  2015년  2016년
9   도봉구  825        238    159     42    386
2   강북구  831        369    120    138    204
5   광진구  878        573     78     53    174
3   강서구  911        388    258    184     81
24  중랑구  916        509    121    177    109

In [45]:
CCTV_Seoul.sort_values(by='소계', ascending=False).head(5)

     구별    소계  2013년도 이전  2014년  2015년  2016년
0   강남구  3238       1292    430    584    932
18  양천구  2482       1843    142     30    467
14  서초구  2297       1406    157    336    398
4   관악구  2109        846    260    390    613
21  은평구  2108       1138    224    278    468

In [49]:
CCTV_Seoul.columns

Index(['구별', '소계', '2013년도 이전', '2014년', '2015년', '2016년', '최근증가욜'], dtype='object')

In [66]:
CCTV_Seoul['최근증가율'] = (CCTV_Seoul['2016년'] + CCTV_Seoul['2015년'] \
                       + CCTV_Seoul['2014년']) / CCTV_Seoul['2013년도 이전'] * 100

CCTV_Seoul.sort_values(by='최근증가율', ascending=False).head(5)

     구별    소계  2013년도 이전  2014년  2015년  2016년       최근증가욜       최근증가율
22  종로구  1619        464    314    211    630  248.922414  248.922414
9   도봉구   825        238    159     42    386  246.638655  246.638655
12  마포구   980        314    118    169    379  212.101911  212.101911
8   노원구  1566        542     57    451    516  188.929889  188.929889
1   강동구  1010        379     99    155    377  166.490765  166.490765

In [70]:
pop_seoul.head()

    구별         인구수        한국인       외국인        고령자
0   합계  10197604.0  9926968.0  270636.0  1321458.0
1  종로구    162820.0   153589.0    9231.0    25425.0
2   중구    133240.0   124312.0    8928.0    20764.0
3  용산구    244203.0   229456.0   14747.0    36231.0
4  성동구    311244.0   303380.0    7864.0    39997.0

In [73]:
# row 삭제
pop_seoul.drop([0], inplace=True)
pop_seoul.head()

    구별       인구수       한국인      외국인      고령자
1  종로구  162820.0  153589.0   9231.0  25425.0
2   중구  133240.0  124312.0   8928.0  20764.0
3  용산구  244203.0  229456.0  14747.0  36231.0
4  성동구  311244.0  303380.0   7864.0  39997.0
5  광진구  372164.0  357211.0  14953.0  42214.0

In [74]:
pop_seoul['구별'].unique()

array(['종로구', '중구', '용산구', '성동구', '광진구', '동대문구', '중랑구', '성북구', '강북구',
       '도봉구', '노원구', '은평구', '서대문구', '마포구', '양천구', '강서구', '구로구', '금천구',
       '영등포구', '동작구', '관악구', '서초구', '강남구', '송파구', '강동구', nan],
      dtype=object)

In [75]:
pop_seoul[pop_seoul['구별'].isnull()]

     구별  인구수  한국인  외국인  고령자
26  NaN  NaN  NaN  NaN  NaN

In [76]:
pop_seoul.drop([26], inplace=True)

In [77]:
pop_seoul.head()

    구별       인구수       한국인      외국인      고령자
1  종로구  162820.0  153589.0   9231.0  25425.0
2   중구  133240.0  124312.0   8928.0  20764.0
3  용산구  244203.0  229456.0  14747.0  36231.0
4  성동구  311244.0  303380.0   7864.0  39997.0
5  광진구  372164.0  357211.0  14953.0  42214.0

In [80]:
pop_seoul['외국인비율'] = pop_seoul['외국인'] / pop_seoul['인구수'] * 100
pop_seoul['고령자비율'] = pop_seoul['고령자'] / pop_seoul['인구수'] * 100
pop_seoul.head()

    구별       인구수       한국인      외국인      고령자     외국인비율      고령자비율
1  종로구  162820.0  153589.0   9231.0  25425.0  5.669451  15.615404
2   중구  133240.0  124312.0   8928.0  20764.0  6.700690  15.583909
3  용산구  244203.0  229456.0  14747.0  36231.0  6.038828  14.836427
4  성동구  311244.0  303380.0   7864.0  39997.0  2.526635  12.850689
5  광진구  372164.0  357211.0  14953.0  42214.0  4.017852  11.342849

In [81]:
pop_seoul.sort_values(by='인구수', ascending=False).head(5)

     구별       인구수       한국인      외국인      고령자     외국인비율      고령자비율
24  송파구  667483.0  660584.0   6899.0  72506.0  1.033584  10.862599
16  강서구  603772.0  597248.0   6524.0  72548.0  1.080540  12.015794
23  강남구  570500.0  565550.0   4950.0  63167.0  0.867660  11.072217
11  노원구  569384.0  565565.0   3819.0  71941.0  0.670725  12.634883
21  관악구  525515.0  507203.0  18312.0  68082.0  3.484582  12.955291

In [82]:
pop_seoul.sort_values(by='외국인', ascending=False).head(5)

      구별       인구수       한국인      외국인      고령자     외국인비율      고령자비율
19  영등포구  402985.0  368072.0  34913.0  52413.0  8.663598  13.006191
17   구로구  447874.0  416487.0  31387.0  56833.0  7.007998  12.689506
18   금천구  255082.0  236353.0  18729.0  32970.0  7.342345  12.925255
21   관악구  525515.0  507203.0  18312.0  68082.0  3.484582  12.955291
6   동대문구  369496.0  354079.0  15417.0  54173.0  4.172440  14.661322

In [83]:
pop_seoul.sort_values(by='외국인비율', ascending=False).head(5)

      구별       인구수       한국인      외국인      고령자     외국인비율      고령자비율
19  영등포구  402985.0  368072.0  34913.0  52413.0  8.663598  13.006191
18   금천구  255082.0  236353.0  18729.0  32970.0  7.342345  12.925255
17   구로구  447874.0  416487.0  31387.0  56833.0  7.007998  12.689506
2     중구  133240.0  124312.0   8928.0  20764.0  6.700690  15.583909
3    용산구  244203.0  229456.0  14747.0  36231.0  6.038828  14.836427

In [84]:
pop_seoul.sort_values(by='고령자', ascending=False).head(5)

     구별       인구수       한국인      외국인      고령자     외국인비율      고령자비율
16  강서구  603772.0  597248.0   6524.0  72548.0  1.080540  12.015794
24  송파구  667483.0  660584.0   6899.0  72506.0  1.033584  10.862599
12  은평구  494388.0  489943.0   4445.0  72334.0  0.899091  14.631019
11  노원구  569384.0  565565.0   3819.0  71941.0  0.670725  12.634883
21  관악구  525515.0  507203.0  18312.0  68082.0  3.484582  12.955291

In [85]:
pop_seoul.sort_values(by='고령자비율', ascending=False).head(5)

      구별       인구수       한국인      외국인      고령자     외국인비율      고령자비율
9    강북구  330192.0  326686.0   3506.0  54813.0  1.061806  16.600342
1    종로구  162820.0  153589.0   9231.0  25425.0  5.669451  15.615404
2     중구  133240.0  124312.0   8928.0  20764.0  6.700690  15.583909
3    용산구  244203.0  229456.0  14747.0  36231.0  6.038828  14.836427
13  서대문구  327163.0  314982.0  12181.0  48161.0  3.723221  14.720797